{
  "buttons": {
    "confirm": "Conferma",
    "cancel": "Annulla",
    "load": "Carica",
    "close": "Chiudi"
  },
  "homepage-content": {
    "tutorial": {
      "step-one": {
        "title": "1. Carica i dati",
        "content": "Carica i dati nella modalità che preferisci: dal tuo file system o dal nostro server. Puoi anche caricare una tabella precedentemente salvata."
      },
      "step-two": {
        "title": "2. Visualizza la tabella",
        "content": "Visualizza la tabella caricata e scopri le operazioni che puoi fare premendo il tasto destro del mouse su celle o colonne"
      },
      "step-three": {
        "title": "3. Utilizza i comandi principali",
        "content": "Riconcilia ed estendi la tua tabella con i comandi principali che compariranno nella barra in altro una volta selezionate una o più colonne"
      }
    },
    "get-data": {
      "where-to-load": {
        "label": "Da dove vuoi caricare i dati?",
        "options": {
          "table-server": "Table Server (tabelle non annotate)",
          "table-saved": "Table Server (tabelle annotate)",
          "file.-system": "File system locale (tabelle CSV e JSON)"
        }
      },
      "choose-from": {
        "server-tables": "Scegli tra le tabelle disponibili:",
        "saved-tables": "Scegli tra le tabelle salvate:"
      },
      "choose-name-modal": {
        "title-text": "La tua tabella è stata caricata",
        "input-label": "Scegli un nome da dare alla tabella:"
      }
    }
  },
  "table": {
    "cells": {
      "editable-cell-modal": {
        "input-label": "Inserisci un valore con cui vuoi modificare la label della cella:",
        "title-text": "Modifica label cella"
      },
      "meta-tooltip": {
        "is-true": "La cella è etichettata ed è presente un match true",
        "is-not-true": "La cella è etichettata ma non è presente un match true"
      }
    }
  },
  "shared": {
    "error": {
      "title-text": "Errore",
      "data-loading": {
        "empty": "Nessun dato caricato"
      },
      "reconciliation": {
        "impossible-connect": "Impossibile connettersi al server"
      },
      "extension": {
        "no-data": "Si è verificato un errore. Controlla di aver inserito i dati richiesti correttamente",
        "data-empty": "Il sistema non ha riportato nessun dato per l'estensione"
      }
    }
  },
  "commands-bar": {
    "reconciliation": {
      "button-label": "Riconcilia",
      "select-reconciliator-modal": {
        "input-label": "Seleziona un servizio:",
        "title-text": "Riconcilia",
        "text": "Seleziona un servizio con cui effettuare la riconciliazione"
      },
      "success-modal": {
        "title-text": "Successo",
        "text": "Riconciliazione avvenuta con successo"
      }
    },
    "extension": {
      "button-label": "Estendi",
      "extension-modal": {
        "title-text": "Estendi colonna",
        "text": "Inserisci le opzioni di estensione richieste"
      },
      "success-modal": {
        "title-text": "Successo",
        "text": "Estensione avvenuta con successo"
      }
    },
    "save": {
      "button-label": "Salva",
      "success-modal": {
        "title-text": "Successo",
        "text": "La tua tabella è stata salvata con successo"
      }
    },
    "save-as": {
      "button-label": "Salva con nome",
      "save-as-modal": {
        "title-text": "Salva con nome",
        "input-label": "Scegli il nome con cui vuoi salvare la tua tabella"
      }
    }
  },
  "context-items": {
    "select-column": "Seleziona colonna",
    "deselect-column": "Deseleziona colonna",
    "delete-column": "Elimina colonna",
    "edit-label": "Modifica label",
    "delete-line": "Elimina riga",
    "reconcile-cell": "Riconcilia cella",
    "expand-entities": "Espandi colonna delle entità",
    "collapse-entities": "Comprimi colonna delle entità",
    "show-metadata": "Gestisci metadati",
    "filter-column": "Filtra colonna",
    "remove-filters": "Rimuovi filtri",
    "finalize-matching": "Finalizza matching"
  },
  "help": {
    "general-help": {
      "title": "Guida generale",
      "topics": {
        "interaction": {
          "title": "Interazione",
          "content": "Utilizza il click destro del mouse per aprire un menù a tendina. Scopri le diverse operazioni che puoi effettuare su righe, celle e colonne. Selezionando una o più colonne compariranno inoltre alcuni bottoni nella barra dei comandi"
        },
        "context-menu": {
          "title": "I menù a tendina",
          "content": "Puoi aprire un menù a tendina cliccando con tasto destro del mouse sulle singole celle, la cella indice di ogni riga, e la cella header delle colonne. Ognuna di queste alternative ti permetterà di svolgere diverse azioni contestuali"
        },
        "drag-columns": {
            "title": "Cambiare ordine delle colonne",
            "content": "È possibile cambiare l'ordine delle colonne premendo sulla cella header di ciscuna di esse e trascinandola nella posizione desiderata"
        },
        "select-column": {
            "title": "Selezionare una colonne",
            "content": "Per selezionare o deselezionare una colonna, premi sulla relativa icona (checkbox) nell'header della colonna oppure premi con il tasto destro e scegli la voce 'Seleziona Colonna'/'Deseleziona Colonna'"
        },
        "delete-column":{
            "title": "Eliminare una colonna",
            "content": "Per eliminare una colonna premere con il tasto destro nella cella header della colonna interessata e scegliere 'Elimina colonna'"
        }, 
        "edit-label": {
            "title": "Editare una cella",
            "content": "Puoi scegliere di modificare la label di una cella premendo con il tasto destro del mouse sulla cella interssata e scegliendo 'Modifica Label"
        },
        "delete-row": {
            "title": "Eliminare una riga",
            "content": "Puoi eliminare una riga della tabella premendo con il tasto destro del mouse sulla cella indice della riga (la prima colonna è costituita da celle indice), e scegliendo 'Elimina Riga"
        },
        "reconcile-column": {
            "title": "Riconciliare una colonna",
            "content": "Per riconciliare una colonna selezionala, poi premi il bottone riconcilia nella barra dei comandi. Scegli il servizio di riconciliazione più adatto leggendone la descrizione nella seziona 'help' dedicata"
        },
        "view-meta": {
            "title": "Visualizzare i metadati di una cella",
            "content": "Per visualizzare i metadati di una cella, premere con il tasto destro sulla cella e scegliere 'Visualizza metadati', da questa modale puoi inoltre assegnare un match: true ad una o più annotazioni"
        },
        "filter-column": {
            "title": "Filtrare una colonna",
            "content": "È possibile filtrare una colonna in base alle proprietà dei metadati delle celle dopo averla riconciliata. Premi con il tasto destro del mouse sulla cella header dellac colonna riconciliata e scegli 'Filtra colonna', scegliere adesso il criterio con cui filtrare"
        },
        "finalize-matching": {
            "title": "Finalizzare il matching di una colonna",
            "content": "Per finalizzare il matching di una colonna riconciliata premi con il tasto destro sulla colonna e scegli finalizza matching. È possibile adesso svegliere una soglia sopra la quale assegnare un match true alle annotazioni delle celle."
        }, 
        "extension": {
            "title": "Estendere la tabella",
            "content": "Per estendere la tabella è necessario che una o più colonne selezionate siano state riconciliate e che contengano una o più celle con match true. I servizi di estensione richiedono delle proprietà particolari: apri la relativa sezione help per scoprirli nel dettaglio."
        }
      }
    },
    "reconciliation-help": {
        "title": "Servizi di riconciliazione",
        "topics": {
            "general": {
                "title": "Note generali",
                "content": "Lo scopo dei servizi di riconciliazione è quello di associare ad ogni label in input una serie di 'metadati' o 'annotazioni' che rappresentano determinate entità. Per completare la riconciliazione è necessario assegnare il 'match true' ad una delle entità assegnate ad ogni label"
            },
            "wikifier": {
                "title": "ASIA (wikifier)",
                "content": "Servizio di riconciliazione generico di ASIA. Può essere utilizzato per riconciliare vari tipi di entità."
            },
            "geonames": {
                "title": "ASIA (geonames)",
                "content": "Servizio di riconciliazione di ASIA per località geografiche. Basato su un dump del database di geonames."
            },
            "keywordsmatcher" : {
                "title": "ASIA (keybords matcher)",
                "content": "Servizio di riconciliazione di ASIA per parole chiave"
            }, 
            "lamapi": {
                "title": "lamAPI",
                "content": "Servizio generico per riconciliazione. Può richiedere un po di tempo per la risposta per tabelle molto grandi."
            }, 
            "wikidata": {
                "title" : "Wikidata",
                "content": "Servizio di riconciliazione di wikidata. Ha un query limit di circa 15 label."
            }
        }
    }, 
    "extension-help": {
        "title": "Servizi di estensione",
        "topics": {
            "general": {
                "title": "Note generali",
                "content": "Lo scopo dei servizi di estensione è quello di estendere la tabella con una nuova colonna contenente nuove informazioni a partire da o più colonne esistenti. I servizi di estensione richiedono che almeno una colonna di quelle selezionate per estendere sia riconciliata e abbia un buon numero di match true (solo i valori su match true verranno estesi). "
            },
            "geonames":{
                "title": "Geonames",
                "content": "Servizio di estensione di ASIA basato su geonames. È possibile estendere la tabella con una nuova colonna contentente località di un certo ordine amministrativo, a partire da una colonna esistente riconciliata con geonames con un ordine amministrativo diverso. "
            }, 
            "weather": {
                "title": "Weather",
                "content": "Servizio di estensione di ASIA basato su weather. È possibile estendere la tabella con alcuni dati metereologici a partire da una colonna di località di ordine amministrativo 1 (Regioni o stati) riconciliata con geonames e una colonna di date (formato gg-mm-aaaa). È inoltre necessario scegliere una proprietà metereologica con la quale estendere la tabella e l'offset (sposta la data di interesse rispetto a quella inserita in input)."
            }
        }
    }
  }
}
