{
  "buttons": {
    "confirm": "Confirm",
    "cancel": "Cancel",
    "load": "Upload",
    "close": "Close"
  },
  "homepage-content": {
    "tutorial": {
      "step-one": {
        "title": "1. Upload the data",
        "content": "Upload the data in the way you prefer: from your file system or from our server. You can also load a previously saved table."
      },
      "step-two": {
        "title": "2. View the table",
        "content": "View the loaded table and discover the operations you can do by pressing the right mouse button on cells or columns."
      },
      "step-three": {
        "title": "3. Use the main commands",
        "content": "Reconcile and extend your table with the main commands that will appear in the top bar one you select one or more columns."
      }
    },
    "get-data": {
      "where-to-load": {
        "label": "Where do you want to upload the data from? ",
        "options": {
          "table-server": "Table Server (raw tables)",
          "table-saved": "Table Server (annotated tables)",
          "file.-system": "Local file system (tabelle CSV e JSON)"
        }
      },
      "choose-from": {
        "server-tables": "Choose from available tables",
        "saved-tables": "Choose from saved tables"
      },
      "choose-name-modal": {
        "title-text": "Your table has been loaded",
        "input-label": "Choose how to name your table"
      }
    }
  },
  "table": {
    "cells": {
      "editable-cell-modal": {
        "input-label": "Insert a value to change the cella label with",
        "title-text": "Edit cell label"
      },
      "meta-tooltip": {
        "is-true": "The cell is labeled and there is a true match",
        "is-not-true": "The cell is labeled but there is no true match",
        "no-label": "The cell could not be reconciled"
      }
    }
  },
  "shared": {
    "error": {
      "title-text": "Error",
      "data-loading": {
        "empty": "No data loaded."
      },
      "reconciliation": {
        "impossible-connect": "Impossible to connect to ricociliator service"
      },
      "extension": {
        "no-data": "An error has occurred. Check that you have entered the required data correctly",
        "data-empty": "The system did not report any data for the extension",
        "no-match": "No entities are matched to the cells of any selected columns. To quickly match all cells of a columns you can use Finalize Matching feature."
      }
    }
  },
  "commands-bar": {
    "reconciliation": {
      "button-label": "Reconcile",
      "select-reconciliator-modal": {
        "input-label": "Select a service",
        "title-text": "Reconcile",
        "text": "Select a service to reconcile with"
      },
      "success-modal": {
        "title-text": "Success",
        "text": "Successful reconciliation"
      }
    },
    "extension": {
      "button-label": "Extend",
      "extension-modal": {
        "title-text": "Extend column",
        "text": "Enter the requested extension options"
      },
      "success-modal": {
        "title-text": "Success",
        "text": "Successful extension"
      }
    },
    "save": {
      "button-label": "Save",
      "success-modal": {
        "title-text": "Success",
        "text": "Your table has been successfully saved"
      }
    },
    "save-as": {
      "button-label": "Save as",
      "save-as-modal": {
        "title-text": "Save as",
        "input-label": "Choose the name with which to save the table"
      }
    }
  },
  "context-items": {
    "select-column": "Select column",
    "deselect-column": "Deselect column",
    "delete-column": "Delete column",
    "edit-label": "Edit label",
    "delete-line": "Delete row",
    "reconcile-cell": "Reconciliate cell",
    "expand-entities": "Expand entity column",
    "collapse-entities": "Collapse entity column",
    "show-metadata": "Manage metadata",
    "filter-column": "Filter column",
    "remove-filters": "Remove filters",
    "finalize-matching": "Finalize matching"
  },
  "help": {
    "title": "Help",
    "general-help": {
      "title": "General guide",
      "titles": {
        "about": "About",
        "columns": "Columns",
        "cells": "Cells",
        "row": "Rows",
        "commands": "Commands",
        "metadata": "Metadata"
      },
      "topics": {
        "interaction": {
          "title": "Interaction",
          "content": "Use the right mouse click to open a drop-down menu. Discover the different operations you can perform on rows, cells and columns. By selecting one or more columns, some buttons will appear in the command bar."
        },
        "context-menu": {
          "title": "Drop down menus",
          "content": "You can open a drop-down menu by right-clicking on the individual cells, the index cell of each row, and the header cell of the columns. Each of these alternatives will allow you to perform different contextual actions."
        },
        "drag-columns": {
          "title": "Change the order of the columns",
          "content": "It is possible to change the order of the columns by pressing on the header cell of each of them and dragging it to the desired position."
        },
        "select-column": {
          "title": "Select a column",
          "content": "To select or deselect a column, click on the relevant icon (checkbox) in the header of the column or press with the right button and choose the item 'Select Column' / 'Deselect Column'."
        },
        "delete-column": {
          "title": "Delete a column",
          "content": "To delete a column press the right button in the header cell of the column concerned and choose 'Delete column'."
        },
        "edit-label": {
          "title": "Edit a cell",
          "content": "You can choose to modify the label of a cell by pressing the right mouse button on the cell concerned and choosing 'Edit Label'."
        },
        "delete-row": {
          "title": "Delete a row",
          "content": "You can delete a row of the table by pressing the right mouse button on the index cell of the row (the first column consists of index cells), and choosing 'Delete Row'."
        },
        "reconcile-column": {
          "title": "Reconcile a column",
          "content": "To reconcile a column select it, then press the reconcile button in the command bar. Choose the most suitable reconciliation service by reading its description in the dedicated 'help' section."
        },
        "view-meta": {
          "title": "Manage metadata",
          "content": "To view and manage the metadata of a cell, right click on the cell and choose 'Manage metadata', from this modal you can also assign a match: true to one or more annotations."
        },
        "filter-column": {
          "title": "Filter a column",
          "content": "You can filter a column based on cell metadata properties after reconciling it. Press with the right mouse button on the header cell of the reconciled column and choose 'Filter column', now choose the criterion to filter."
        },
        "finalize-matching": {
          "title": "Finalize the matching",
          "content": "To finalize the matching of a reconciled column, right click on the column and choose finalize matching. It is now possible to wake up a threshold above which to assign a true match to cell annotations."
        },
        "extension": {
          "title": "Extend the table",
          "content": "To extend the table, one or more selected columns must have been reconciled and contain one or more cells with true match. Extension services require particular properties: open the relative help section to discover them in detail."
        }
      }
    },
    "reconciliation-help": {
      "title": "Reconciliation services",
      "titles": {
        "about": "About",
        "services": "Services"
      },
      "topics": {
        "general": {
          "title": "General notes",
          "content": "The purpose of the reconciliation services is to associate a series of 'metadata' or 'annotations' representing certain entities to each input label. To complete the reconciliation it is necessary to assign the 'match true' to one of the entities assigned to each label"
        },
        "wikifier": {
          "title": "ASIA (wikifier)",
          "content": "ASIA generic reconciliation service. It can be used to reconcile various types of entities."
        },
        "geonames": {
          "title": "ASIA (geonames)",
          "content": "ASIA reconciliation service for geographic locations. Based on a dump of the geonames database."
        },
        "keywordsmatcher": {
          "title": "ASIA (keybords matcher)",
          "content": "ASIA Keyword Reconciliation Service"
        },
        "lamapi": {
          "title": "lamAPI",
          "content": "Generic service for reconciliation. It may take some time to respond for very large tables."
        },
        "wikidata": {
          "title": "Wikidata",
          "content": "Wikidata reconciliation service. It has a query limit of about 15 labels."
        }
      }
    },
    "extension-help": {
      "title": "Extension services",
      "titles": {
        "about": "About",
        "services": "Services"
      },
      "topics": {
        "general": {
          "title": "General notes",
          "content": "The purpose of the extension services is to extend the table with a new column containing new information starting from or more existing columns. Extension services require that at least one of the columns selected to extend be reconciled and have a good number of true matches (only values ​​on true match will be extended). "
        },
        "geonames": {
          "title": "Geonames",
          "content": "ASIA extension service based on geonames. With geonames it is possible to retrieve data on locations of a certain administrative order, given a reconciled column containing locations of a different administrative order. \nTo extend the table with geonames you need: \n - A column reconciled and matched with geonames. \n - Enter the administrative level of the locations you want to output. \nNote: The geonames extension service may not work correctly for locations outside of Germany."
        },
        "weather": {
          "title": "Weather",
          "content": "ASIA weather-based extension service. With weather it is possible to retrieve meteorological data for given locations and dates. \nTo extend with weather you need: \n - A column reconciled and matched or extended with geonames containing locations of the first administrative level (Regions). \n - A column of dates in ISO format yyyy-mm-dd \n - Insert one or more WeatherParameters, these correspond to the meteorological parameter with which you want to extend the table. \n - Enter the offset: the difference in days for which we want to retrieve the data with respect to the input dates. \nNote: the weather extension service is available only for the years between 2017 and 2019 and only for the regions German."
        }
      }
    }
  },
  "extension-modal": {
    "select-columns": "Select a column for the values: ",
    "select-columns-2": "Selezionare una colonna",
    "selected-values": "Selected values: ",
    "select-values": "Select one or more property values: "
  }
}
